const treeType =[
  {
    id:0,
    zw_name:'刺槐',
    ld_name:'Robinia pseudoacacia',
    family:'豆科',
    genus:'刺槐属',
    pic_url: require('@/assets/images/mini/CH_mini.jpg')
  },
  { 
    id:1,
    zw_name:'旱柳',
    ld_name:'Salix matsudana',
    family:'杨柳科',
    genus:'柳属',
    pic_url: require('@/assets/images/mini/HL_mini.jpg')
  },
  {
    id:2,
    zw_name:'馒头柳',
    ld_name:"Salix matsudana 'Umbraculifera'",
    family:'杨柳科',
    genus:'柳属',
    pic_url: require('@/assets/images/mini/ML_mini.jpg')
  },
  {
    id:3,
    zw_name:'银杏',
    ld_name:"Gingkgo biloba",
    family:'银杏科',
    genus:'银杏属',
    pic_url: require('@/assets/images/mini/YX_mini.jpg')
  },
  {
    id:4,
    zw_name:'栾树',
    ld_name:"Koelreuteria paniculata",
    family:'无患子科',
    genus:'栾属',
    pic_url: require('@/assets/images/mini/LS_mini.jpg')
  },
  {
    id:5,
    zw_name:'国槐',
    ld_name:"Styphnolobium japonicum",
    family:'豆科',
    genus:'槐属',
    pic_url: require('@/assets/images/mini/GH_mini.jpg')
  },
  {
    id:6,
    zw_name:'洋白蜡',
    ld_name:"Fraxinus pennsylvanica",
    family:'木樨科',
    genus:'梣属',
    pic_url: require('@/assets/images/mini/YL_mini.jpg')
  },
]
// 各多边形区域边界坐标(大部分从右下角的点开始，顺时针方向)、名称、区域颜色
//  0:刺槐  1:旱柳 2:馒头柳 3:银杏 4：栾树 5：国槐 6：洋白蜡
export const multiplePolygons = [
    {
      path: [[116.3431690, 40.0027682], [116.3400090, 40.0027682], [116.3400090, 40.0040540],[116.3401090, 40.0044040],[116.3430090, 40.0044540]], 
      color: '#87CEEB', 
      name:'操场和体育馆区',
      totalNum:35,
      treeList:[treeType[0],treeType[1],treeType[2]]
    },
    {
      path: [[116.3421690, 40.0027682], [116.3400090, 40.0027682],[116.340040, 40.0022682],[116.3421690, 40.0022682]], 
      color: '#52C387', 
      name:'档案馆及西区餐饮大楼区',
      totalNum:1,
      treeList:[treeType[0]]
      
    },
    {
      path: [[116.3421690, 40.0027682], [116.3431690, 40.0027682],[116.3431690, 40.0008354],[116.3421690, 40.0008054]], 
      color: '#FDFD98', 
      name:'银杏大道及一、二、三、九号楼区',
      totalNum:7,
      treeList:[treeType[0],treeType[4],treeType[5] ]
    },
    {
      path: [[116.3421690, 40.0022682], [116.3421690, 40.0008054],[116.3414690, 40.0007854],[116.3414690, 40.0022682]], 
      color: '#FFC0CB', 
      name:'四、五、六号楼区',
      totalNum:1,
      treeList:[treeType[0]]
    },
    {
      path: [[116.3414690, 40.0022682], [116.3414690, 40.0007854],[116.3405690, 40.0007694],[116.3405690, 40.0022682]], 
      color: '#87CEEB', 
      name:'闪电广场及七、十号楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3405690, 40.0022682], [116.3405690, 40.0007694],[116.3400690, 40.0007694],[116.340040, 40.0022682]], 
      color: '#FDFD98', 
      name:'草学楼及停车场区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3431690, 40.0008354], [116.3431690, 40.0018482],[116.3444690, 40.0018482],[116.3444690, 40.0008694]], 
      color: '#FFC0CB', 
      name:'林业楼区',
      totalNum:2,
      treeList:[treeType[3] ]
    },
    {
      path: [[116.3431690, 40.0018482], [116.3431690, 40.0023482],[116.3444690, 40.0023482],[116.3444690, 40.0018482]], 
      color: '#87CEEB', 
      name:'生物楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3431690, 40.0023482],[116.3431690, 40.0027682], [116.34312100, 40.0032982],[116.3444690, 40.0033482],[116.3444690, 40.0023482]], 
      color: '#FFC0CB', 
      name:'行政楼区',
      totalNum:2,
      treeList:[treeType[6]]
    },
    {
      path: [[116.3444690, 40.0023482], [116.3444690, 40.0033482],[116.3449190, 40.0033482],[116.3449190, 40.0023482]], 
      color: '#52C387', 
      name:'林之心区',
      totalNum:1,
      treeList:[treeType[6]]
    },
    {
      path: [[116.3449190, 40.0023482], [116.3449190, 40.0033482],[116.3460690, 40.0033682],[116.3460690, 40.0023482]], 
      color: '#FFC0CB', 
      name:'博物馆及林沼区',
      totalNum:1,
      treeList:[treeType[1]]
    },
    {
      path: [[116.3460690, 40.0023482], [116.3460690, 40.0033682],[116.3463690, 40.0033682],[116.3463690, 40.0023482]], 
      color: '#87CEEB', 
      name:'流书播惠亭区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3444690, 40.0016482], [116.3444690, 40.0023482],[116.3463690, 40.0023482],[116.3463690, 40.0016482]], 
      color: '#FDFD98', 
      name:'主楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3444690,40.0008694], [116.3444690, 40.0016482],[116.3461690, 40.0016482],[116.3461690, 40.0011582],[116.3457690, 40.0011582],[116.3457690, 40.0009094]], 
      color: '#87CEEB', 
      name:'主楼草坪区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3457690, 40.0009094], [116.3457690,40.0011582],[116.3461690, 40.0011582],[116.3461690, 40.0014582],[116.3475690, 40.0014582],[116.3475690, 40.0009594]], 
      color: '#FFC0CB', 
      name:'学子情花园区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3461690, 40.0014582], [116.3461690,40.0016482],[116.3463690, 40.0016482],[116.3463690, 40.0019482],[116.3475690, 40.0019482],[116.3475690, 40.0014582]], 
      color: '#52C387', 
      name:'森工楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3475690, 40.0009594], [116.3475690, 40.0022482],[116.3489017, 40.0022482],[116.3489017, 40.0009994]], 
      color: '#87CEEB', 
      name:'学研中心区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3463690, 40.0019482], [116.3463690, 40.0024482],[116.3475690, 40.0024482],[116.3475690, 40.0019482]], 
      color: '#FFC0CB', 
      name:'理化楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3463690, 40.0024482], [116.3463690, 40.0033682],[116.3475690, 40.0033682],[116.3475690, 40.0024482]], 
      color: '#FDFD98', 
      name:'科研楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3475690, 40.0022482], [116.3475690, 40.0033682],[116.3490017, 40.0033682],[116.3489017, 40.0022482]], 
      color: '#52C387', 
      name:'二教区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3461590, 40.0033682], [116.3461590, 40.0040682],[116.3478690, 40.0040682],[116.3478690, 40.0033682]], 
      color: '#FFC0CB', 
      name:'图书馆区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3478690, 40.0033682], [116.3478690, 40.0047682],[116.3490017, 40.0047682],[116.3490017, 40.0033682]], 
      color: '#87CEEB', 
      name:'环境楼及一教区',
      totalNum:3,
      treeList:[treeType[0]]
    },
    {
      path: [[116.3461590, 40.0040682], [116.3461590, 40.0047682],[116.3478690, 40.0047682],[116.3478690, 40.0040682]], 
      color: '#FDFD98', 
      name:'家属区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3461590, 40.0047682], [116.3461590, 40.0057682],[116.3489217, 40.0057682],[116.3490017, 40.0047682]], 
      color: '#52C387', 
      name:'下沉广场及东区餐饮大楼区',
      totalNum:0,
      treeList:[]
    },
    {
      path: [[116.3461590, 40.0057682], [116.3461350, 40.0065722],[116.3488317, 40.0066382],[116.3489217, 40.0057682]], 
      color: '#FFC0CB', 
      name:'十一、十二号楼区',
      totalNum:0,
      treeList:[]
    },
]